# Target Cleaning: Converting Amount(in rupees) to Numeric

### Objective:
Convert text house prices like "42 Lac" and "1.40 Cr" into numeric rupee values
usable for machine learning models.

In [41]:
import pandas as pd
import numpy as np

In [42]:
df = pd.read_csv("house_prices.csv")

In [43]:
df["Amount(in rupees)"].head(10)

0      42 Lac
1      98 Lac
2     1.40 Cr
3      25 Lac
4     1.60 Cr
5      45 Lac
6    16.5 Lac
7      60 Lac
8      60 Lac
9     1.60 Cr
Name: Amount(in rupees), dtype: object

In [44]:
df["Amount(in rupees)"].sample(10)

135245           23 Lac
5702             50 Lac
41514            72 Lac
83145            50 Lac
123205          2.68 Cr
27711          97.2 Lac
107576    Call for Price
111589          1.20 Cr
67077            90 Lac
92136           1.20 Cr
Name: Amount(in rupees), dtype: object

In [45]:
def convert_to_rupees(value):
    if not isinstance(value, str):
        return np.nan

    if "Lac" in value:
        return float(value.replace("Lac","").strip()) * 1e5
    elif "Cr" in value:
        return float(value.replace("Cr","").strip()) * 1e7
    else:
        return np.nan

In [46]:
df["target_price_rupees"] = df["Amount(in rupees)"].apply(convert_to_rupees)

In [47]:
df[['Amount(in rupees)', 'target_price_rupees']].head(10)

  Amount(in rupees)  target_price_rupees
0           42 Lac             4200000.0
1           98 Lac             9800000.0
2          1.40 Cr            14000000.0
3           25 Lac             2500000.0
4          1.60 Cr            16000000.0
5           45 Lac             4500000.0
6         16.5 Lac             1650000.0
7           60 Lac             6000000.0
8           60 Lac             6000000.0
9          1.60 Cr            16000000.0

In [48]:
df.to_csv("house_price_target_cleaned.csv",index=False)